Repository: LittleSixNine/PhotoTrail
Catalog: Sources/PhotoTrail/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, pt_br, zh_hans, zh_hant

# 请自定义文字
source: Enter custom text
es: Introduce tu texto
ja: 任意の文字を入力
ko: 사용자 지정 문구 입력
pt_br: Digite seu texto
zh_hans: 请自定义文字
zh_hant: 請自訂文字

# 示例：%1$@
source: Example: %1$@
es: Ejemplo: %1$@
ja: 例：%1$@
ko: 예시: %1$@
pt_br: Exemplo: %1$@
zh_hans: 示例：%1$@
zh_hant: 範例：%1$@

# 照片：%1$@；关联文件一并列入右侧预览。
source: Photos: %1$@; associated files are included in the preview on the right.
es: Fotos: %1$@; los archivos asociados se incluyen en la vista previa de la derecha.
ja: 写真：%1$@。関連ファイルも右側のプレビューに含まれます。
ko: 사진: %1$@장. 연결된 파일도 오른쪽 미리보기에 포함됩니다.
pt_br: Fotos: %1$@; arquivos associados são incluídos na prévia à direita.
zh_hans: 照片：%1$@；关联文件一并列入右侧预览。
zh_hant: 照片：%1$@；關聯檔案一併列入右側預覽。

# 其中 %1$@ 张不是本地文件，无法直接重命名。
source: %1$@ photos are not local files and cannot be renamed directly.
es: %1$@ fotos no son archivos locales y no se pueden renombrar directamente.
ja: %1$@ 枚はローカルファイルではないため、直接名前を変更できません。
ko: %1$@장의 사진은 로컬 파일이 아니므로 이름을 직접 변경할 수 없습니다.
pt_br: %1$@ fotos não são arquivos locais e não podem ser renomeadas diretamente.
zh_hans: 其中 %1$@ 张不是本地文件，无法直接重命名。
zh_hant: 其中 %1$@ 張不是本機檔案，無法直接重新命名。

# 拖动以调整规则顺序
source: Drag to reorder rules
es: Arrastra para ordenar las reglas
ja: ドラッグしてルールを並べ替え
ko: 드래그하여 규칙 순서 변경
pt_br: Arraste para reordenar as regras
zh_hans: 拖动以调整规则顺序
zh_hant: 拖動以調整規則順序

# 粘贴到所选字段
source: Paste into selected fields
es: Pegar en los campos seleccionados
ja: 選択したフィールドに貼り付け
ko: 선택한 필드에 붙여넣기
pt_br: Colar nos campos selecionados
zh_hans: 粘贴到所选字段
zh_hant: 貼上到所選欄位

# 粘贴失败
source: Paste failed
es: Error al pegar
ja: 貼り付けに失敗しました
ko: 붙여넣기 실패
pt_br: Falha ao colar
zh_hans: 粘贴失败
zh_hant: 貼上失敗

# 未修改任何字段。请检查剪贴板内容、目标字段格式，并确认来源文件没有变化。
source: No fields were changed. Check the clipboard content and destination formats, and confirm the source files have not changed.
es: No se ha modificado ningún campo. Revisa el contenido del portapapeles y los formatos de destino, y confirma que los archivos de origen no hayan cambiado.
ja: フィールドは変更されていません。クリップボードの内容とコピー先の形式を確認し、元ファイルが変更されていないことを確認してください。
ko: 변경된 필드가 없습니다. 클립보드 내용과 대상 필드 형식을 확인하고 원본 파일이 변경되지 않았는지 확인하세요.
pt_br: Nenhum campo foi alterado. Verifique o conteúdo da área de transferência e os formatos de destino e confirme que os arquivos de origem não foram alterados.
zh_hans: 未修改任何字段。请检查剪贴板内容、目标字段格式，并确认来源文件没有变化。
zh_hant: 未修改任何欄位。請檢查剪貼簿內容、目標欄位格式，並確認來源檔案沒有變化。

# 替换
source: Replace
es: Reemplazar
ja: 置き換え
ko: 바꾸기
pt_br: Substituir
zh_hans: 替换
zh_hant: 替換

# 在开头添加
source: Add at beginning
es: Añadir al principio
ja: 先頭に追加
ko: 맨 앞에 추가
pt_br: Adicionar no início
zh_hans: 在开头添加
zh_hant: 在開頭新增

# 在结尾添加
source: Add at end
es: Añadir al final
ja: 末尾に追加
ko: 맨 뒤에 추가
pt_br: Adicionar no final
zh_hans: 在结尾添加
zh_hant: 在結尾新增

# 在指定文字前添加
source: Add before specified text
es: Añadir antes del texto indicado
ja: 指定文字の前に追加
ko: 지정한 텍스트 앞에 추가
pt_br: Adicionar antes do texto indicado
zh_hans: 在指定文字前添加
zh_hant: 在指定文字前新增

# 在指定文字后添加
source: Add after specified text
es: Añadir después del texto indicado
ja: 指定文字の後に追加
ko: 지정한 텍스트 뒤에 추가
pt_br: Adicionar depois do texto indicado
zh_hans: 在指定文字后添加
zh_hant: 在指定文字後新增

# 在指定位置添加
source: Add at specified position
es: Añadir en la posición indicada
ja: 指定位置に追加
ko: 지정한 위치에 추가
pt_br: Adicionar na posição indicada
zh_hans: 在指定位置添加
zh_hant: 在指定位置新增

# 按固定间隔设置时间
source: Set times at fixed intervals
es: Asignar horas a intervalos fijos
ja: 一定間隔で時刻を設定
ko: 일정 간격으로 시간 설정
pt_br: Definir horários em intervalos fixos
zh_hans: 按固定间隔设置时间
zh_hant: 按固定間隔設定時間

# 在时间范围内均匀分配
source: Distribute evenly within a time range
es: Distribuir uniformemente en un intervalo de tiempo
ja: 指定した時間範囲に均等に割り当て
ko: 시간 범위 안에 균등하게 배분
pt_br: Distribuir uniformemente em um intervalo de tempo
zh_hans: 在时间范围内均匀分配
zh_hant: 在時間範圍內均勻分配

# 把值复制到字段
source: Copy value to fields
es: Copiar el valor a campos
ja: 値をフィールドにコピー
ko: 값을 필드에 복사
pt_br: Copiar o valor para campos
zh_hans: 把值复制到字段
zh_hant: 把值複製到欄位

# 修改预览
source: Change preview
es: Vista previa de cambios
ja: 変更のプレビュー
ko: 변경 미리 보기
pt_br: Prévia das alterações
zh_hans: 修改预览
zh_hant: 修改預覽

# 开始时间
source: Start time
es: Hora de inicio
ja: 開始時刻
ko: 시작 시간
pt_br: Horário inicial
zh_hans: 开始时间
zh_hant: 開始時間

# 每张照片间隔（秒）
source: Interval per photo (seconds)
es: Intervalo por foto (segundos)
ja: 写真ごとの間隔（秒）
ko: 사진 간격(초)
pt_br: Intervalo por foto (segundos)
zh_hans: 每张照片间隔（秒）
zh_hant: 每張照片間隔（秒）

# 接收字段
source: Destination fields
es: Campos de destino
ja: コピー先のフィールド
ko: 대상 필드
pt_br: Campos de destino
zh_hans: 接收字段
zh_hant: 接收欄位

# 添加接收字段…
source: Add destination fields…
es: Añadir campos de destino…
ja: コピー先を追加…
ko: 대상 필드 추가…
pt_br: Adicionar campos de destino…
zh_hans: 添加接收字段…
zh_hant: 新增接收欄位…

# 将上方来源字段的值复制到以下字段，覆盖原值；来源字段保持不变。
source: Copy the source value to the destination fields, replacing their values; the source stays unchanged.
es: Copia el valor de origen a los campos de destino y sustituye sus valores; el origen no cambia.
ja: コピー元の値をコピー先に上書きします。コピー元は変更されません。
ko: 원본 값을 대상 필드에 복사하여 기존 값을 덮어씁니다. 원본 필드는 변경되지 않습니다.
pt_br: Copie o valor de origem para os campos de destino, substituindo seus valores; a origem permanece inalterada.
zh_hans: 将上方来源字段的值复制到以下字段，覆盖原值；来源字段保持不变。
zh_hant: 將上方來源欄位的值複製到以下欄位，覆蓋原值；來源欄位保持不變。

# 批量预设…
source: Batch presets…
es: Preajustes por lotes…
ja: 一括プリセット…
ko: 일괄 프리셋…
pt_br: Predefinições em lote…
zh_hans: 批量预设…
zh_hant: 批次預設…

# 读取完成
source: Read complete
es: Lectura completada
ja: 読み込み完了
ko: 읽기 완료
pt_br: Leitura concluída
zh_hans: 读取完成
zh_hant: 讀取完成

# 搜索名称、标签或值
source: Search names, tags or values
es: Buscar nombres, etiquetas o valores
ja: 名前・タグ・値を検索
ko: 이름, 태그 또는 값 검색
pt_br: Pesquisar nomes, etiquetas ou valores
zh_hans: 搜索名称、标签或值
zh_hant: 搜尋名稱、標籤或值

# 批量操作与预设…
source: Batch actions and presets…
es: Acciones por lotes y preajustes…
ja: 一括操作とプリセット…
ko: 일괄 작업 및 프리셋…
pt_br: Ações em lote e predefinições…
zh_hans: 批量操作与预设…
zh_hant: 批次操作與預設…

# 编排操作
source: Compose actions
es: Componer acciones
ja: 操作を組み立てる
ko: 작업 구성
pt_br: Compor ações
zh_hans: 编排操作
zh_hant: 編排操作

# 操作按顺序执行；每张照片使用自己的字段值，后一步读取前一步的结果。
source: Actions run in order. Each photo uses its own values; later actions read earlier results.
es: Las acciones se ejecutan en orden. Cada foto usa sus valores; las posteriores leen los resultados anteriores.
ja: 操作は順番に実行されます。各写真の値を使い、後の操作は前の結果を読みます。
ko: 작업은 순서대로 실행됩니다. 각 사진의 값을 사용하며 다음 작업은 이전 결과를 읽습니다.
pt_br: As ações são executadas em ordem. Cada foto usa seus valores; as seguintes leem os resultados anteriores.
zh_hans: 操作按顺序执行；每张照片使用自己的字段值，后一步读取前一步的结果。
zh_hant: 操作依序執行；每張照片使用自己的欄位值，後一步讀取前一步的結果。

# 目标字段
source: Target field
es: Campo de destino
ja: 対象項目
ko: 대상 필드
pt_br: Campo de destino
zh_hans: 目标字段
zh_hant: 目標欄位

# 更新操作
source: Update action
es: Actualizar acción
ja: 操作を更新
ko: 작업 업데이트
pt_br: Atualizar ação
zh_hans: 更新操作
zh_hant: 更新操作

# 取消编辑
source: Cancel editing
es: Cancelar edición
ja: 編集をキャンセル
ko: 편집 취소
pt_br: Cancelar edição
zh_hans: 取消编辑
zh_hant: 取消編輯

# 新建预设
source: New preset
es: Nuevo preajuste
ja: 新規プリセット
ko: 새 프리셋
pt_br: Nova predefinição
zh_hans: 新建预设
zh_hant: 新增預設

# 预设已保存。
source: Preset saved.
es: Preajuste guardado.
ja: プリセットを保存しました。
ko: 프리셋이 저장되었습니다.
pt_br: Predefinição salva.
zh_hans: 预设已保存。
zh_hant: 預設已儲存。

# 预设已导入，可编辑并预览。
source: Preset imported. You can edit and preview it.
es: Preajuste importado. Puede editarlo y previsualizarlo.
ja: プリセットを読み込みました。編集してプレビューできます。
ko: 프리셋을 가져왔습니다. 편집하고 미리 볼 수 있습니다.
pt_br: Predefinição importada. Você pode editá-la e visualizá-la.
zh_hans: 预设已导入，可编辑并预览。
zh_hant: 預設已匯入，可編輯並預覽。

# 删除操作
source: Delete action
es: Eliminar acción
ja: 操作を削除
ko: 작업 삭제
pt_br: Excluir ação
zh_hans: 删除操作
zh_hant: 刪除操作

# IPTC 时间必须包含时区，例如 12:34:56+08:00。
source: IPTC time requires a time zone, for example 12:34:56+08:00.
es: La hora IPTC requiere una zona horaria, por ejemplo 12:34:56+08:00.
ja: IPTC 時刻にはタイムゾーンが必要です。例：12:34:56+08:00。
ko: IPTC 시간에는 시간대가 필요합니다. 예: 12:34:56+08:00.
pt_br: A hora IPTC exige um fuso horário, por exemplo 12:34:56+08:00.
zh_hans: IPTC 时间必须包含时区，例如 12:34:56+08:00。
zh_hant: IPTC 時間必須包含時區，例如 12:34:56+08:00。

# 搜索包含全部字段。
source: Search includes all fields.
es: La búsqueda incluye todos los campos.
ja: 検索対象はすべての項目です。
ko: 검색에는 모든 필드가 포함됩니다.
pt_br: A pesquisa inclui todos os campos.
zh_hans: 搜索包含全部字段。
zh_hant: 搜尋包含全部欄位。

# 文件系统
source: File system
es: Sistema de archivos
ja: ファイルシステム
ko: 파일 시스템
pt_br: Sistema de arquivos
zh_hans: 文件系统
zh_hant: 檔案系統

# XMP Rating
source: Rating (XMP)
es: Valoración (XMP)
ja: 評価（XMP）
ko: 평점 (XMP)
pt_br: Classificação (XMP)
zh_hans: 评分（XMP）
zh_hant: 評分（XMP）

# XMP Label
source: Label (XMP)
es: Etiqueta (XMP)
ja: ラベル（XMP）
ko: 레이블 (XMP)
pt_br: Rótulo (XMP)
zh_hans: 标签（XMP）
zh_hant: 標籤（XMP）

# Metadata field: ResolutionUnit
source: Resolution unit
es: Unidad de resolución
ja: 解像度単位
ko: 해상도 단위
pt_br: Unidade de resolução
zh_hans: 分辨率单位
zh_hant: 解析度單位

# 文件时间不能清除；未记录时区的输入按本机时区处理。
source: File timestamps cannot be cleared. Input without a time zone uses the local time zone.
es: Las fechas del archivo no se pueden borrar. Sin zona horaria se usa la zona local.
ja: ファイル時刻は消去できません。タイムゾーンのない入力にはローカル設定を使用します。
ko: 파일 시간은 지울 수 없습니다. 시간대가 없는 입력은 로컬 시간대를 사용합니다.
pt_br: As datas do arquivo não podem ser apagadas. Sem fuso horário, usa-se o fuso local.
zh_hans: 文件时间不能清除；未记录时区的输入按本机时区处理。
zh_hant: 檔案時間不能清除；未記錄時區的輸入按本機時區處理。

# 此字段为结构或计算信息，尚未接入可靠写回；GPS 请在地图定位中编辑。
source: This structural or derived field has no verified write path. Edit GPS in the map workspace.
es: Este campo estructural o calculado no tiene una ruta de escritura verificada. Edite el GPS en el mapa.
ja: 構造情報または計算値のため、安全な書き込みに未対応です。GPS は地図で編集してください。
ko: 구조 또는 계산 필드로 검증된 저장 기능이 없습니다. GPS는 지도에서 편집하세요.
pt_br: Este campo estrutural ou calculado não tem gravação verificada. Edite o GPS no mapa.
zh_hans: 此字段为结构或计算信息，尚未接入可靠写回；GPS 请在地图定位中编辑。
zh_hant: 此欄位為結構或計算資訊，尚未接入可靠寫回；GPS 請在地圖定位中編輯。

# 全部导入预计剩余约 %1$@ 秒
source: Estimated time remaining for the entire import: about %1$@ seconds
es: Tiempo estimado restante para toda la importación: unos %1$@ segundos
ja: 読み込み全体の推定残り時間：約 %1$@ 秒
ko: 전체 가져오기 예상 남은 시간: 약 %1$@초
pt_br: Tempo estimado restante para toda a importação: cerca de %1$@ segundos
zh_hans: 全部导入预计剩余约 %1$@ 秒
zh_hant: 全部導入預計剩餘約 %1$@ 秒

# 正在估算全部导入剩余时间…
source: Estimating the remaining time for the entire import…
es: Estimando el tiempo restante para toda la importación…
ja: 読み込み全体の残り時間を推定中…
ko: 전체 가져오기 남은 시간 계산 중…
pt_br: Estimando o tempo restante para toda a importação…
zh_hans: 正在估算全部导入剩余时间…
zh_hant: 正在估算全部導入剩餘時間…

# 后缀格式
source: Suffix format
es: Formato del sufijo
ja: 接尾辞の形式
ko: 접미사 형식
pt_br: Formato do sufixo
zh_hans: 后缀格式
zh_hant: 後綴格式

# 数字位数
source: Number width
es: Número de dígitos
ja: 数字の桁数
ko: 숫자 자릿수
pt_br: Quantidade de dígitos
zh_hans: 数字位数
zh_hant: 數字位數

# 正在计算文件名并检查冲突…
source: Calculating filenames and checking conflicts…
es: Calculando nombres y comprobando conflictos…
ja: ファイル名を計算し、重複を確認中…
ko: 파일 이름 계산 및 충돌 확인 중…
pt_br: Calculando nomes e verificando conflitos…
zh_hans: 正在计算文件名并检查冲突…
zh_hant: 正在計算檔名並檢查衝突…

# 您导入的照片较多，处理需要一些时间，请耐心等待。
source: You imported many photos. Processing may take some time; please wait.
es: Ha importado muchas fotos. El procesamiento puede tardar; espere un momento.
ja: 読み込む写真が多いため、処理に時間がかかります。しばらくお待ちください。
ko: 가져온 사진이 많아 처리에 시간이 걸릴 수 있습니다. 잠시 기다려 주세요.
pt_br: Você importou muitas fotos. O processamento pode demorar; aguarde.
zh_hans: 您导入的照片较多，处理需要一些时间，请耐心等待。
zh_hant: 您導入的照片較多，處理需要一些時間，請耐心等待。

# 正在生成重命名预览…
source: Generating rename preview…
es: Generando la vista previa del cambio de nombre…
ja: 名前変更のプレビューを生成中…
ko: 이름 변경 미리보기 생성 중…
pt_br: Gerando a prévia da renomeação…
zh_hans: 正在生成重命名预览…
zh_hant: 正在生成重新命名預覽…

# 正在读取照片信息并计算文件名，请稍候。
source: Reading photo information and calculating filenames. Please wait.
es: Leyendo la información de las fotos y calculando los nombres. Espere un momento.
ja: 写真情報を読み取り、ファイル名を計算しています。しばらくお待ちください。
ko: 사진 정보를 읽고 파일 이름을 계산하고 있습니다. 잠시 기다려 주세요.
pt_br: Lendo as informações das fotos e calculando os nomes. Aguarde.
zh_hans: 正在读取照片信息并计算文件名，请稍候。
zh_hant: 正在讀取照片資訊並計算檔名，請稍候。

# 正在导入照片
source: Importing photos
es: Importando fotos
ja: 写真を読み込み中
ko: 사진 가져오는 중
pt_br: Importando fotos
zh_hans: 正在导入照片
zh_hant: 正在導入照片

# 第 1 / 2 步：导入文件
source: Step 1 of 2: Import files
es: Paso 1 de 2: Importar archivos
ja: ステップ 1 / 2：ファイルの読み込み
ko: 1 / 2단계: 파일 가져오기
pt_br: Etapa 1 de 2: Importar arquivos
zh_hans: 第 1 / 2 步：导入文件
zh_hant: 第 1 / 2 步：導入檔案

# 第 2 / 2 步：准备元数据
source: Step 2 of 2: Prepare metadata
es: Paso 2 de 2: Preparar metadatos
ja: ステップ 2 / 2：メタデータの準備
ko: 2 / 2단계: 메타데이터 준비
pt_br: Etapa 2 de 2: Preparar metadados
zh_hans: 第 2 / 2 步：准备元数据
zh_hant: 第 2 / 2 步：準備中繼資料

# 正在恢复原文件名…
source: Restoring original filenames…
es: Restaurando los nombres originales…
ja: 元のファイル名を復元中…
ko: 원래 파일 이름 복원 중…
pt_br: Restaurando os nomes originais…
zh_hans: 正在恢复原文件名…
zh_hant: 正在恢復原檔名…

# 正在停止…
source: Stopping…
es: Deteniendo…
ja: 停止中…
ko: 중지 중…
pt_br: Parando…
zh_hans: 正在停止…
zh_hant: 正在停止…

# 正在检查文件…
source: Checking files…
es: Comprobando archivos…
ja: ファイルを確認中…
ko: 파일 확인 중…
pt_br: Verificando arquivos…
zh_hans: 正在检查文件…
zh_hant: 正在檢查檔案…

# 正在准备修改名称…
source: Preparing to rename…
es: Preparando el cambio de nombre…
ja: 名前変更を準備中…
ko: 이름 변경 준비 중…
pt_br: Preparando a renomeação…
zh_hans: 正在准备修改名称…
zh_hant: 正在準備修改名稱…

# 正在修改文件名…
source: Renaming files…
es: Renombrando archivos…
ja: ファイル名を変更中…
ko: 파일 이름 변경 중…
pt_br: Renomeando arquivos…
zh_hans: 正在修改文件名…
zh_hant: 正在修改檔名…

# 正在核对结果…
source: Verifying results…
es: Verificando resultados…
ja: 結果を確認中…
ko: 결과 검증 중…
pt_br: Conferindo resultados…
zh_hans: 正在核对结果…
zh_hant: 正在核對結果…

# 正在重命名照片
source: Renaming photos
es: Renombrando fotos
ja: 写真の名前を変更中
ko: 사진 이름 변경 중
pt_br: Renomeando fotos
zh_hans: 正在重命名照片
zh_hant: 正在重新命名照片

# 检查文件 → 修改名称 → 核对结果
source: Check files → Rename → Verify results
es: Comprobar archivos → Renombrar → Verificar resultados
ja: ファイル確認 → 名前変更 → 結果確認
ko: 파일 확인 → 이름 변경 → 결과 검증
pt_br: Verificar arquivos → Renomear → Conferir resultados
zh_hans: 检查文件 → 修改名称 → 核对结果
zh_hant: 檢查檔案 → 修改名稱 → 核對結果

# 当前阶段已处理 %1$@/%2$@ 个文件
source: Files processed in this stage: %1$@/%2$@
es: Archivos procesados en esta etapa: %1$@/%2$@
ja: 現在の段階で処理済み：%1$@/%2$@ ファイル
ko: 현재 단계 처리 파일: %1$@/%2$@
pt_br: Arquivos processados nesta etapa: %1$@/%2$@
zh_hans: 当前阶段已处理 %1$@/%2$@ 个文件
zh_hant: 目前階段已處理 %1$@/%2$@ 個檔案

# 包含关联文件；完成前请勿关闭程序。
source: Includes related files. Do not close the app until finished.
es: Incluye archivos relacionados. No cierre la aplicación hasta que termine.
ja: 関連ファイルを含みます。完了するまでアプリを閉じないでください。
ko: 관련 파일을 포함합니다. 완료될 때까지 앱을 닫지 마세요.
pt_br: Inclui arquivos relacionados. Não feche o aplicativo antes de concluir.
zh_hans: 包含关联文件；完成前请勿关闭程序。
zh_hant: 包含關聯檔案；完成前請勿關閉程式。

source: The first available photo extension from left to right determines the new filename; the other files follow. For example, jpg before arw gives JPG priority; placing arw first gives RAW priority.
es: La primera extensión de foto disponible, de izquierda a derecha, determina el nuevo nombre; los demás archivos lo siguen. Por ejemplo, jpg antes de arw da prioridad a JPG; arw primero da prioridad a RAW.
ja: 左から順に、実際に存在する写真を優先し、その写真を基に新しい名前を計算します。他のファイルも同じ名前になります。jpg が arw より前なら JPG、arw が先なら RAW を優先します。
ko: 왼쪽부터 실제로 존재하는 사진을 우선 선택하여 새 파일 이름을 계산하고 나머지 파일도 같은 이름으로 변경합니다. jpg가 arw 앞이면 JPG를, arw가 앞이면 RAW를 우선합니다.
pt_br: A primeira extensão de foto disponível, da esquerda para a direita, determina o novo nome; os outros arquivos seguem. Por exemplo, jpg antes de arw prioriza JPG; arw primeiro prioriza RAW.
zh_hans: 按从左到右的顺序优先选取实际存在的照片，依据它计算新文件名，其他文件跟随改名。例如 jpg 在 arw 前面时，以 JPG 为准；将 arw 放在前面则优先以 RAW 为准。
zh_hant: 按從左到右的順序優先選取實際存在的照片，依據它計算新檔名，其他檔案跟隨改名。例如 jpg 在 arw 前面時，以 JPG 為準；將 arw 放在前面則優先以 RAW 為準。

# 这些附属文件跟随照片一起改名，排列顺序不影响优先级。
source: These companion files are renamed with the photo. Their order does not affect priority.
es: Estos archivos auxiliares se renombran con la foto. Su orden no afecta a la prioridad.
ja: これらの関連ファイルは写真と一緒に名前が変更されます。並び順は優先順位に影響しません。
ko: 이 관련 파일은 사진과 함께 이름이 변경됩니다. 나열 순서는 우선순위에 영향을 주지 않습니다.
pt_br: Esses arquivos auxiliares são renomeados com a foto. A ordem não afeta a prioridade.
zh_hans: 这些附属文件跟随照片一起改名，排列顺序不影响优先级。
zh_hant: 這些附屬檔案跟隨照片一起改名，排列順序不影響優先級。

# 照片及关联文件一起改名
source: Rename photos and related files together
es: Renombrar juntos los archivos del mismo nombre
ja: 同じ名前のファイルをまとめて変更
ko: 같은 이름의 파일을 함께 이름 변경
pt_br: Renomear juntos os arquivos de mesmo nome
zh_hans: 照片及关联文件一起改名
zh_hant: 照片及關聯檔案一起改名

# 重命名设置
source: Rename settings
es: Configuración de renombrado
ja: 名前変更の設定
ko: 이름 변경 설정
pt_br: Configurações de renomeação
zh_hans: 重命名设置
zh_hant: 重新命名設定

# 重命名设置…
source: Rename settings…
es: Configuración de renombrado…
ja: 名前変更の設定…
ko: 이름 변경 설정…
pt_br: Configurações de renomeação…
zh_hans: 重命名设置…
zh_hant: 重新命名設定…

# 照片文件扩展名
source: Photo extensions
es: Extensiones de fotos
ja: 写真の拡張子
ko: 사진 확장자
pt_br: Extensões de fotos
zh_hans: 照片文件扩展名
zh_hant: 照片檔案副檔名

# 附属文件扩展名
source: Companion file extensions
es: Extensiones de archivos auxiliares
ja: 関連ファイルの拡張子
ko: 관련 파일 확장자
pt_br: Extensões de arquivos auxiliares
zh_hans: 附属文件扩展名
zh_hant: 附屬檔案副檔名

# 扩展名用逗号分隔，不加点。
source: Separate extensions with commas, without dots.
es: Separe las extensiones con comas, sin puntos.
ja: 拡張子はドットを付けず、カンマで区切ります。
ko: 확장자는 점 없이 쉼표로 구분하세요.
pt_br: Separe as extensões com vírgulas, sem pontos.
zh_hans: 扩展名用逗号分隔，不加点。
zh_hant: 副檔名以逗號分隔，不加點。

# 同一文件夹内，同名的 JPG、RAW 和 XMP 等文件会一起改名，保留各自扩展名。
source: Files in the same folder with matching names and different extensions are renamed together, such as IMG_001.JPG, IMG_001.ARW and IMG_001.xmp. All files appear in the preview and keep their own extensions.
es: Los archivos de la misma carpeta con el mismo nombre y distintas extensiones se renombran juntos, como IMG_001.JPG, IMG_001.ARW e IMG_001.xmp. Todos aparecen en la vista previa y conservan sus extensiones.
ja: 同じフォルダ内で名前が同じで拡張子が異なるファイルをまとめて変更します（例：IMG_001.JPG、IMG_001.ARW、IMG_001.xmp）。すべてプレビューに表示され、それぞれの拡張子は保持されます。
ko: 같은 폴더에서 이름은 같고 확장자가 다른 파일을 함께 변경합니다. 예: IMG_001.JPG, IMG_001.ARW, IMG_001.xmp. 모든 파일은 미리보기에 표시되며 각 확장자는 유지됩니다.
pt_br: Arquivos na mesma pasta com o mesmo nome e extensões diferentes são renomeados juntos, como IMG_001.JPG, IMG_001.ARW e IMG_001.xmp. Todos aparecem na prévia e mantêm suas extensões.
zh_hans: 同一文件夹内，同名的 JPG、RAW 和 XMP 等文件会一起改名，保留各自扩展名。
zh_hant: 同一資料夾內，同名的 JPG、RAW 和 XMP 等檔案會一起改名，保留各自副檔名。

# 正在扫描文件…
source: Scanning files…
es: Buscando archivos…
ja: ファイルをスキャン中…
ko: 파일 검색 중…
pt_br: Buscando arquivos…
zh_hans: 正在扫描文件…
zh_hant: 正在掃描檔案…

# 正在导入基础信息…
source: Importing basic information…
es: Importando información básica…
ja: 基本情報を読み込み中…
ko: 기본 정보 가져오는 중…
pt_br: Importando informações básicas…
zh_hans: 正在导入基础信息…
zh_hant: 正在匯入基本資訊…

# 正在导入轨迹…
source: Importing tracks…
es: Importando rutas…
ja: 軌跡を読み込み中…
ko: 경로 가져오는 중…
pt_br: Importando trajetos…
zh_hans: 正在导入轨迹…
zh_hant: 正在匯入軌跡…

# 已处理 %1$@/%2$@
source: Processed: %1$@/%2$@
es: Procesados: %1$@/%2$@
ja: 処理済み：%1$@/%2$@
ko: 처리됨: %1$@/%2$@
pt_br: Processados: %1$@/%2$@
zh_hans: 已处理 %1$@/%2$@
zh_hant: 已處理 %1$@/%2$@

# 正在估算当前阶段剩余时间…
source: Estimating remaining time for this stage…
es: Estimando el tiempo restante de esta etapa…
ja: 現在の段階の残り時間を計算中…
ko: 현재 단계의 남은 시간 계산 중…
pt_br: Estimando o tempo restante desta etapa…
zh_hans: 正在估算当前阶段剩余时间…
zh_hant: 正在估算目前階段剩餘時間…

# 当前阶段预计剩余约 %1$@ 秒
source: Estimated time left in this stage: about %1$@ seconds
es: Tiempo estimado restante de esta etapa: unos %1$@ segundos
ja: 現在の段階の残り時間：約 %1$@ 秒
ko: 현재 단계 예상 남은 시간: 약 %1$@초
pt_br: Tempo restante estimado desta etapa: cerca de %1$@ segundos
zh_hans: 当前阶段预计剩余约 %1$@ 秒
zh_hant: 目前階段預計剩餘約 %1$@ 秒

# 正在准备照片元数据…
source: Preparing photo metadata…
es: Preparando metadatos de fotos…
ja: 写真のメタデータを準備中…
ko: 사진 메타데이터 준비 중…
pt_br: Preparando metadados das fotos…
zh_hans: 正在准备照片元数据…
zh_hant: 正在準備照片中繼資料…

# 暂停读取
source: Pause reading
es: Pausar lectura
ja: 読み取りを一時停止
ko: 읽기 일시 중지
pt_br: Pausar leitura
zh_hans: 暂停读取
zh_hant: 暫停讀取

# 继续读取
source: Resume reading
es: Reanudar lectura
ja: 読み取りを再開
ko: 읽기 재개
pt_br: Retomar leitura
zh_hans: 继续读取
zh_hant: 繼續讀取

# 可以切换到其他应用，读取会继续。
source: You can switch to another app while reading continues.
es: Puedes cambiar de aplicación mientras continúa la lectura.
ja: 他のアプリに切り替えても読み取りは続きます。
ko: 다른 앱으로 전환해도 읽기는 계속됩니다.
pt_br: Você pode mudar de aplicativo enquanto a leitura continua.
zh_hans: 可以切换到其他应用，读取会继续。
zh_hant: 可以切換到其他應用程式，讀取會繼續。

# 可编辑字段：%1$@/%2$@
source: Editable fields: %1$@/%2$@
es: Campos editables: %1$@/%2$@
ja: 編集可能な項目：%1$@/%2$@
ko: 편집 가능한 필드: %1$@/%2$@
pt_br: Campos editáveis: %1$@/%2$@
zh_hans: 可编辑字段：%1$@/%2$@
zh_hant: 可編輯欄位：%1$@/%2$@

# 完整字段：%1$@/%2$@
source: Full fields: %1$@/%2$@
es: Campos completos: %1$@/%2$@
ja: 全項目：%1$@/%2$@
ko: 전체 필드: %1$@/%2$@
pt_br: Campos completos: %1$@/%2$@
zh_hans: 完整字段：%1$@/%2$@
zh_hant: 完整欄位：%1$@/%2$@

# 设备
source: Device
es: Dispositivo
ja: 機器
ko: 기기
pt_br: Dispositivo
zh_hans: 设备
zh_hant: 裝置

# 多个值
source: Multiple values
es: Varios valores
ja: 複数の値
ko: 여러 값
pt_br: Vários valores
zh_hans: 多个值
zh_hant: 多個值

# 选择机型将填入已核实的品牌和所选名称；下方仍可自定义。
source: Choosing a model fills its verified maker and the selected name. You can still customize them below.
es: Al elegir un modelo se introducen el fabricante verificado y el nombre elegido. Puedes modificarlos abajo.
ja: 機種を選ぶと確認済みのメーカーと選択した名前を入力します。下で編集できます。
ko: 기종을 선택하면 확인된 제조사와 선택한 이름이 입력됩니다. 아래에서 직접 수정할 수 있습니다.
pt_br: Ao escolher um modelo, o fabricante verificado e o nome escolhido são preenchidos. Você pode editá-los abaixo.
zh_hans: 选择机型将填入已核实的品牌和所选名称；下方仍可自定义。
zh_hant: 選擇機型將填入已核實的品牌和所選名稱；下方仍可自訂。

# 直接编辑数值；修改暂存后，统一写入照片。
source: Edit values directly. Changes remain drafts until written to photos.
es: Edita los valores directamente. Los cambios quedan en borrador hasta escribirlos en las fotos.
ja: 値を直接編集できます。変更は下書きとして保持し、まとめて写真に書き込みます。
ko: 값을 직접 편집하세요. 변경은 초안에 보관한 뒤 사진에 함께 기록합니다.
pt_br: Edite os valores diretamente. As alterações ficam em rascunho até serem gravadas nas fotos.
zh_hans: 直接编辑数值；修改暂存后，统一写入照片。
zh_hant: 直接編輯數值；修改暫存後，統一寫入照片。

# 批量调整…
source: Batch adjustments…
es: Ajustes por lotes…
ja: 一括調整…
ko: 일괄 조정…
pt_br: Ajustes em lote…
zh_hans: 批量调整…
zh_hant: 批次調整…

# 其他来源的常用字段
source: Common fields from other sources
es: Campos habituales de otras fuentes
ja: 他のソースのよく使う項目
ko: 다른 출처의 자주 쓰는 필드
pt_br: Campos comuns de outras fontes
zh_hans: 其他来源的常用字段
zh_hant: 其他來源的常用欄位

# 查看完整字段与标签来源
source: View all fields and tag sources
es: Ver todos los campos y sus fuentes
ja: すべての項目とタグのソースを表示
ko: 전체 필드 및 태그 출처 보기
pt_br: Ver todos os campos e suas origens
zh_hans: 查看完整字段与标签来源
zh_hant: 檢視完整欄位與標籤來源

# 编辑范围：所选 %1$@ 张照片
source: Editing scope: %1$@ selected photos
es: Ámbito: %1$@ fotos seleccionadas
ja: 編集範囲：選択した写真 %1$@ 枚
ko: 편집 범위: 선택한 사진 %1$@장
pt_br: Escopo: %1$@ fotos selecionadas
zh_hans: 编辑范围：所选 %1$@ 张照片
zh_hant: 編輯範圍：所選 %1$@ 張照片

# 选择日期与时间
source: Choose date and time
es: Elegir fecha y hora
ja: 日時を選択
ko: 날짜 및 시간 선택
pt_br: Escolher data e hora
zh_hans: 选择日期与时间
zh_hant: 選擇日期與時間

# 多个值；添加关键词会保留每张照片原有的关键词。
source: Multiple values. Adding keywords preserves each photo’s existing keywords.
es: Varios valores. Al añadir palabras clave se conservan las existentes de cada foto.
ja: 複数の値。キーワードを追加しても各写真の既存キーワードは保持されます。
ko: 여러 값이 있습니다. 키워드를 추가해도 각 사진의 기존 키워드는 유지됩니다.
pt_br: Vários valores. Adicionar palavras-chave preserva as existentes em cada foto.
zh_hans: 多个值；添加关键词会保留每张照片原有的关键词。
zh_hant: 多個值；新增關鍵字會保留每張照片原有的關鍵字。

# 输入关键词后回车
source: Enter a keyword, then press Return
es: Escribe una palabra clave y pulsa Intro
ja: キーワードを入力して Return
ko: 키워드 입력 후 Return
pt_br: Digite uma palavra-chave e pressione Return
zh_hans: 输入关键词后回车
zh_hant: 輸入關鍵字後按 Return
